# Display the R3 running configurations :

a. Pour afficher les adresses IP des interfaces de R3 :

```
R3# show ip interface brief
```

b. Pour vérifier la route par défaut statique de R3 :

```
R3# show ip route
```

c. Pour afficher la configuration actuelle de R3 :

```
R3# show run
```

d. Pour vérifier si la configuration de sécurité a été appliquée à R3 :

```
R3# show run | include security
```
